#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "12be6fe918952b2470803df4db8acbd9" -> "b6fbfe8ad99dc87fb3491bf029497913"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "6357ebedd1c9ec8ea9741b9efc5c66ba" -> "159919f09c0a53b881d7187e1518af4e"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "253d4719f63a488f56604e7c2a77a743" -> "6f03bd619cf16dd2729588aac0c968ea"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "cef5c5ce64919cfe5d1f9967a2530d54" -> "dd106003982d211e9a0f608358a1da53"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "89698d94850f871ca1d4142fe9efda01" -> "53f344e2257ec97e03a6c0326e8f8cad"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "b8e3ff781db1973eaa4ea6cea036dfb5" -> "25ab8745090cf71403eb9ea5ae0f2d53"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "0ecd55e418614ebe164dc3b9ca4be98e" -> "6c63016a0f22b43f32b8b57e2dc3283e"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "b818557f807f60408f2ff022c3b5ae63" -> "8c8b9b1b0021b9233a8005c549fbabba"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "d8c7786860fa7cbb22890f3a0d1696b9" -> "7fc05a4cc7ce4362a4a52304110ffec3"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "42cb98ebcbb5390f3b73d3fadd7a1b49" -> "fd29b6b0f8cf518dd057db3d5e0c70c2"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "69cdd35d4a8c962ca98b71c7dc30b953" -> "0dcdb9c0775f7ebc9f2c75186cc9f951"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "8149826ac93f56855ee25f3b806adad5" -> "2a870a15eff1ee1e0e95c677eb6893cc"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "6e49c98c7364c5efbee60b882a6c5f50" -> "c11561fd63b15d40dd234d40feec46cb"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "b923e18455190f82e0e2c930f0b443d1" -> "f9dcb3f4685f1736c7714e6d4c57f9be"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "251e95486f1f4fee9be2b26e908036de" -> "ee11d03524fed1f317cebec5cf06ff4c"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "e44ba4ae11f1b0036666fa196f7457a2" -> "408343a407654a310e32613d60b2fabe"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "2bab5d2d5c56d95acd6994eaf911298a" -> "c29f2e0b5fff0dd6017c4e56415f3e0d"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "eb8861dc58c1cb92a813ae6372c946d1" -> "5e3f01dd8884cab8980dcf7c2a2cbfb3"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "87bf2566d319e4c24e632007f439086f" -> "d2a56cd41c4c4b66101774fca0bdc669"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "1ee9498c8af79680766ecb3a68b69f94" -> "4d0342ea7c8f2085640d721dee8c9544"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "986312d9f32934ad0d5fdd0f7a44832e" -> "0dcc1df123d27d5428067033f243f016"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "2e77c62adedf80d1732c4c0a68c8ade3" -> "c5f7b3d8ad377e264c4451c8d1369132"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "5d6a7850616c62cc9d4a1a1d64ac8070" -> "78fe8e2c9916ebb5c995ba438ac32b78"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "b7a673479f5b4652bbfa420ea296207f" -> "47ea30d225dd5de9c70a93891e5d639d"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "3778fac49358643d89b90d519a77ed65" -> "1624cd8db435e88650c6e2d75c5a17fa"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "354df8a6f2ae07e32d3993395fdf6054" -> "986be229200f5dd4ca1d8a7ba6627e18"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "76ecb3a78304813a0e9e04ad5e9039f9" -> "eaa19e47e168c4d2ac205286986a1a81"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "08300282efebe487d8b58dd13bb88b66" -> "cbff2136623b34f9e2d546af3d428119"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "491c6cc713fd3a3f4e3b5f79d7f5e569" -> "4098df6dda7ff388b34a6e98d19686d5"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "5cbe05e60b57c567698fa202a943e76e" -> "9a2fbb76163235dc73d3babe09de0453"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "c128c4847ce0bc58e9f79e92e07e5212" -> "a3cc7b2c52e7bfb9ef4750b4f012decd"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "7e4c5b2242d96f44d2257dd9e69a866d" -> "940999200df89ca6acb8444a6f110e5c"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "7784a8ce1318d390fc420168c3a44821" -> "510f9b2b03afd96107f9cb905f028fe1"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "5e9accdfb294d4495c74187a4a15a4b3" -> "ed69b81803f6d6a09ba91191ecc70649"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "2cd6ed72536462417dea6f9c81ba497c" -> "c5adf5054716c3867e8c962dfb7a18c7"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1fb429dc87f27d7dac4310350e2cc8af" -> "b3fb65a3301bfb75d98111ea095b63ca"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "0bcb593d4f484e6cbd10e9e3a94c6196" -> "5892a446fd120e25ce18248bbbd3debf"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "b8e26774a91b5f09ed38bbc62737c241" -> "374fdeb259e6570d5f00b0ac881e0b75"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "870f2cfb0e5dbdefbe91ac2ad5d0c318" -> "c666e599b6c2f76591fe782620e2202b"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "9bd61dc2c806314f06caa02dea88a387" -> "6684499166d39f13afff27c0ae3092b0"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "113a63c1fed40120c45967254d6d7f44" -> "73355606cd76fad97f26c1a9bc1724dc"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "246f57882b1694bbb531b7ccc903911a" -> "ce56b7cf3b07c1e28f2677bcb30ac54d"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "7761f2d55e143a17974de33561ad13cf" -> "76364acc2bc272e771f79721bb77120f"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "79e5c40fb183d362500a357f06241256" -> "f9727d00609192664b8042c858276633"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "fb61efccea6e454d076b4d5616d99fff" -> "d48cf2b5fb387305996f317c87987ec8"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "vQjV3miEiSxKt1au1FAjOl2qhJegnxngh9POhIlPXAs=" -> "/+RTW7vNWihTlviigKU0BCJZQUlEhWPg9MNGI/JTS7o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "+du9BtoQr++9bI0fjg9LKvdOQ5rNAZ0QLA9qdz9G3j8=" -> "b+8KMPsixTkZhmUYOHAdmYKL7N2pbE2vTHAQsN6d9+M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "6LvvZocueXIWbSKK2SZAlmPJU82oF6bwJOSwZsmhw9w=" -> "AqkAt8Z1H0DTRV7VV5mB7SGQ7kI+1h7wOQtg4s7lSew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "y0Pf/ZQkfl6CQQJfcAbAa9IQflsSA1/fnMaM3QECsSY=" -> "6KEsPmMYL3HGh4qnI9+XpREKWW4QDjpS+PiN0Z6N0qY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "OAxx1IEz1S/mh3kQsNDWigX0GwhCgq9Ltuk++zPPOcI=" -> "gD3ct+4M4Lc+FD3EH6YxgzE0OSkXV3++0Lsqpg8SkkY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "5r+sk5M+GZYPqdTa34/Yr6vqr8O8R2dY8ChMXQD7dss=" -> "K+Li0uM73pfFxEowhLtynghPzEz+tIp8wC86TYS9lJM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "xGgCJZTTC7sGQJHfmiVrRYniA/lEwQjfwupO8P/4zHE=" -> "m/scnG9HwkmL8ZONFEdMvd5PJ0DnWrbW+fUfojkojWU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "1Z/rZgEIYL9J/PELwAxQl+luNe0kGYBcKSSF0KJkm/Q=" -> "2Ad5li9nEwQ+j7b8SrA/WQsQylFHkzpA8NNBDqH/XTg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-23T17:15:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "tJipGbrvmggwkNz0r5nWmhAErhun7DzYAyhhXmMOGZc=" -> "SlxDcCVQv7a220hkwc/8J28EwuFaqmKuk2SE/nuM6BA="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "ncoBHY4Fwn5WNOa4D+9liWwJLlNiHVMzqHcHsJ7N7JU=" -> "4MkvPlL245oQm3cWSX0mGdwI5Ej7ypbFYLGbjkWJfN0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlDYHKVVnOnNNroEB64Md+oUBRNM4PCrMdf+eNoaRIo=" -> "zrf3cZiVnKjL8I/xPGgGjGvr6qJUJvICjfUx/2vV1F0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "dGL8f71LvK1CFzZim9D+uaGf6+TeIQHSvb8Sr1QGk4k=" -> "/ZhmD7v7wMDY18QCBEVWJYiVFsH9AWl2Ye5YD1mbvQk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "hgF1c1oML+8x6HXbNLrGRpHUS7ihWATgGGdfaZ2xce8=" -> "rIbY656fu+B+sca2UgnHC6BDYklUezElIcIV/8EpFL4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "7c11mxPr7jWrk9c0XK+XwjIMhTaDWAUFLAndt3JfwPM=" -> "vnXcCucZ4qZWw7DsDJn1TwOU7z5/rS48Cz8gzYLIAjU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "fm8dRGBZfcsP9pmlnGFArj1f8D/xa95Ullzwszk5SWw=" -> "bMZZpytm7yv0HrJYgwTmUEcLoTJwpGG44JOG+Eg/rvo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "nVK927GqGiYQ8zg7l/9JiCZjzkKzQuhsSrDmwRmaEzs=" -> "CXcmPPgRL84PXbNJTVRLIPMxlQmJ8UqfxKoAjcqaTzc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "fKX8HLYMCE9RFB66xVIIQyR2+v18Vz0mX+0NkoT+1Ls=" -> "Pk6guQJvY1yVNrKokzyM+uQxUOx7ZkJK2Fx0XKsEN34="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "E5Nd8cjj3Vyf6nOwsazQ7ROlaaRpUGvjn57RFBpGWgk=" -> "futLHTn7NdTuUBvjanTxVCMH+VTypqUNeGV6eKhlzFY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "a1Aeig1tSiG79m2vJqi7QqBm5tQBipAn67FyV5lPN2s=" -> "C2d3tAWGtOk+skfsQHy6j/Y/mXX8BHjjczrlO0nbxLs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "wNH0fFag4SRVKl4kpRqnu0CRj6NpmUHZtzjmvTrlkgE=" -> "keE6WfgDKnGahdIbRv0a/pWR1Y2bu1CxUg0iTyoDQH4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "rwXpQbtuAOhuOgS8Ew1VzN5kmIElr27HS7JFHETWr98=" -> "7VGdKcR2ZCg7Ma5ZL3v0LWSt3VO9LtDJPfVKN/n4btw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "KdVvkK/K/oNs7iNexfBnucpXLjOOIjcLIhf4rnRFXlA=" -> "oew18swVfDPHZnyEzIOxrnufo3BALnlbnkYpzq0nVJs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "YUMESgSdkAamqWFJ695vrjWT3aZbJKkgYCxtZGo3pSM=" -> "wmCrfsbZPeMZuRPRWj7pvA10a6VTTf7fjnQa+88sUcs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "4Uuc26p5Ua0tQ+oa68SpC8GBGKHh0vW6PJxrfmFlsbk=" -> "qXqTCLbr/ImavYfoSQqhq4cPA8/hA3hiNY3zgUD5HrY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "8W23oeV51AgM40bRWLG3FZslJpRQYv9ID3zxjYaKxTA=" -> "SoXrH4ZQx192htN5Q/qkxY5KfgAC31F1tSUYID8/APg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "V+pWDdXHx+GFVCZ9+93NlFzRdBZPTJJs/aJI/PS8xD0=" -> "ksAeHmhxm3GZDM4R73CQYfOrU13E8gNOQVixyR0WLE0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "25NONkmjsYIs0lAoSMIePDbODnWP85t+ZwAsc7eTxkw=" -> "UTtKTF01lKQpFl/GUHiBNuRZG81Iv9Iu1kBofjjuwfE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "5QzhyBsyArTRK6fXa6VuljbawEhn//kKdPdJeV7d204=" -> "Hkorq7jlJKXhNgyqrGyDrv4UzhWA341FMVSFaZZmSzc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "qQvzDx8TC/tO5m0R77OWwdBEzSBswmzjaCoLwnQRcq0=" -> "sTQ3gRS6R9XLM6/aEXFij4cRtSyndUHyocqQCxJ92xE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "3VHsJo57zefZi5eSt2jGXC6FmKimMSCi8tLcb1gh0iY=" -> "kcoG4i7nwmR+Si8kXSrl79nfv5vbSvd3wgLGA+xDVXI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "EwbbTTqcel++N1LQcqIG5gm8MqL6KC5o2ERk/2TFJ8Y=" -> "ULMaQmEQhs3m3xrR9/wJcR78PiYAxaxcXcbH+7YeVcU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "3qQeqGv25s5Q5joyMcr2s+GfHOzv/hRwjf8OAGDDTtg=" -> "YL6K3a+1KLZ+BSnmLgWzTNlHacdPhSjafg8zaS9cqO4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ke9YIPF+M4/5M3YvfuIWX4URDfo0IK4nukDzU0PhfAA=" -> "JIpYGKgb0PTnA8b3Q2XdiobbX8j+IG0sKlmWjM01mSs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "RDB5OqNWLMT+luMR3mg4q/PxlIl9ZnKP5QNOQa1t20w=" -> "SD44vC2yMWZ6xP4T/RtTqvjLtUbJJ8CImSzcm5JkuTs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "oMrnbQYRpfRsvOMI9x/1+q4YX19SMLbxwQhx0dK9b8Y=" -> "EkGdT/Nthw0L+sQdNdTdc6jFm7MngUmPWHaAfz/1HVQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "FIAPBZNekYqw90fsGTWceNSh0jjdDkKIPvlVxhsYGn8=" -> "HHgWd3SqunTF2xZX7E1nduVvWPI3d7UppvKQwNDxEfo="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "dJG6p2oM7OuymOe+PcvZ/DWDS8afuvKpfKVaR9uuudc=" -> "OXA6C9jzTcjBzb8FIhUnzQE0a64ZfHvLSj3yGEI1+cU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "bjQr7ef2Uh4nojOSyOfO/UlSDsFGUzVuNpaoZANG2Ac=" -> "NpqdXbNLhYMq0vivw2sFoIeGf3LICLXpcCtCGZkdqIk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "9uOPy0M48qikSpxXbxsIy+MO4qHb7mVsDhBIGjqq5yU=" -> "CxAn3LL+L7LSwHr8jipyOfqJ54MzC3SkN7mPW4DigMM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "LLbXKUnhCmE2596TkRIZXmro/UGy5pMT0O+rHEFLxBI=" -> "5BVeddyTZsTrylmCak3AaQsmoTVEstlHj9AMKnKnOWs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "x0inBNH7plKcWz2gy6wIdN6XOMQl7blFTQVo8i8I+ks=" -> "h3jTFn6ZiVbA0A8WPWOSQ7g45fYLZ6uEaJJV6Wl7LRg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "S781DeSkUnA93CrnkhOfeF/ufi4Id3cR1efLiMURZTY=" -> "cwEzDDMpbvFwiWuxgZeOFVGBkA7Jyp4icO/C5CjjlCA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "DShmEgmzMI9CaLUBjJIxu47uDlMTm4g+jYysAippq8I=" -> "iv4cVD+Q154ylIgt/LtKr3ojj3XGXQhEFKCzrez9Kuc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "ly/bcaTeb6X4kPxrwUSqMN+xORie+KVLoNieP4lWZzs=" -> "PInhxcLqBgUOfCFIdaUnbBseHf1bE5msqEbHojm88SQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-23T17:15:59Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "8p3hvm" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-23T17:15:58Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-23T17:15:55Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*